# Challenge

What is Preppin' Data? 

Preppin' Data is a website that posts weekly real world data preparation challenges for data professionals to solve using Tableau Prep. However, to demonstrate my SQL and Python capabilities I will be solving the challenges with these tools. 

This weeks challenge: https://preppindata.blogspot.com/2024/01/2024-week-2-average-price-analysis.html

# Install and Import

In [85]:
import pandas as pd
import pandasql as ps
import sqlite3

# Get Data

## Read Data

In [62]:
path1 = '/Users/Mark1/Documents/Data Science/preppin_data/2024/week_2/data/input/PD 2024 Wk 1 Output Flow Card.csv'
path2 = '/Users/Mark1/Documents/Data Science/preppin_data/2024/week_2/data/input/PD 2024 Wk 1 Output Non-Flow Card.csv'

In [63]:
# Connect to an SQLite database (in memory for temporary use)
conn = sqlite3.connect(':memory:')  # Use ':memory:' for a temporary database
cursor = conn.cursor()

In [64]:
# Read the CSV into a pandas DataFrame
df1 = pd.read_csv(path1)

In [65]:
df1.head()

,Date,Flight Number,From,To,Class,Price,Flow Card?,Bags Checked,Meal Type
0,22/07/2024,PA010,Tokyo,New York,Economy,2380.0,Yes,0,Egg Free
1,20/04/2024,PA002,New York,London,Economy,3490.0,Yes,1,Vegan
2,23/01/2024,PA010,Tokyo,New York,Premium Economy,825.0,Yes,1,Vegetarian
3,05/06/2024,PA006,Tokyo,London,First Class,618.0,Yes,3,Vegan
4,30/03/2024,PA004,Perth,London,First Class,446.0,Yes,1,Nut Free

In [66]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1883 entries, 0 to 1882
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           1883 non-null   object
 1   Flight Number  1883 non-null   object
 2   From           1883 non-null   object
 3   To             1883 non-null   object
 4   Class          1883 non-null   object
 5   Price          1883 non-null   float64
 6   Flow Card?     1883 non-null   object
 7   Bags Checked   1883 non-null   int64
 8   Meal Type      1594 non-null   object
dtypes: float64(1), int64(1), object(7)
memory usage: 132.5+ KB

In [67]:
# Read the CSV into a pandas DataFrame
df2 = pd.read_csv(path2)

## Create and Load SQLite DB table

In [68]:
cursor.execute(
"""
CREATE TABLE table1 (
    "Date" TEXT,
    "Flight Number" TEXT,
    "From" TEXT,
    "To" TEXT,
    "Class" TEXT,
    "Price" REAL,
    "Flow Card?" TEXT,
    "Bags Checked" INTEGER,
    "Meal Type" TEXT
);
""")

In [69]:
# Load the DataFrame into the SQLite table
df1.to_sql('table1', conn, if_exists='replace', index=False)

1883

In [70]:
# Verify the schema using PRAGMA
query = """ 
PRAGMA table_info('table1')
"""

query_result = pd.read_sql_query(query, conn)
query_result

   cid           name     type  notnull dflt_value  pk
0    0           Date     TEXT        0       None   0
1    1  Flight Number     TEXT        0       None   0
2    2           From     TEXT        0       None   0
3    3             To     TEXT        0       None   0
4    4          Class     TEXT        0       None   0
5    5          Price     REAL        0       None   0
6    6     Flow Card?     TEXT        0       None   0
7    7   Bags Checked  INTEGER        0       None   0
8    8      Meal Type     TEXT        0       None   0

In [71]:
query = """ 
SELECT * 
FROM table1 
LIMIT 5
"""

query_result = pd.read_sql_query(query, conn)
query_result

,Date,Flight Number,From,To,Class,Price,Flow Card?,Bags Checked,Meal Type
0,22/07/2024,PA010,Tokyo,New York,Economy,2380.0,Yes,0,Egg Free
1,20/04/2024,PA002,New York,London,Economy,3490.0,Yes,1,Vegan
2,23/01/2024,PA010,Tokyo,New York,Premium Economy,825.0,Yes,1,Vegetarian
3,05/06/2024,PA006,Tokyo,London,First Class,618.0,Yes,3,Vegan
4,30/03/2024,PA004,Perth,London,First Class,446.0,Yes,1,Nut Free

In [72]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1895 entries, 0 to 1894
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           1895 non-null   object
 1   Flight Number  1895 non-null   object
 2   From           1895 non-null   object
 3   To             1895 non-null   object
 4   Class          1895 non-null   object
 5   Price          1895 non-null   float64
 6   Flow Card?     1895 non-null   object
 7   Bags Checked   1895 non-null   int64
 8   Meal Type      1595 non-null   object
dtypes: float64(1), int64(1), object(7)
memory usage: 133.4+ KB

In [73]:
df2.head()

,Date,Flight Number,From,To,Class,Price,Flow Card?,Bags Checked,Meal Type
0,28/09/2024,PA008,Perth,New York,Economy,1855.0,No,2,Vegetarian
1,01/10/2024,PA008,Perth,New York,Business Class,634.8,No,0,Vegetarian
2,04/03/2024,PA007,New York,Perth,Business Class,458.4,No,3,Nut Free
3,25/02/2024,PA010,Tokyo,New York,Premium Economy,1435.0,No,0,NaN
4,29/03/2024,PA004,Perth,London,Economy,2730.0,No,2,Vegan

In [74]:
cursor.execute(
"""
CREATE TABLE table2 (
    "Date" TEXT,
    "Flight Number" TEXT,
    "From" TEXT,
    "To" TEXT,
    "Class" TEXT,
    "Price" REAL,
    "Flow Card?" TEXT,
    "Bags Checked" INTEGER,
    "Meal Type" TEXT
);
""")

In [75]:
# Load the DataFrame into the SQLite table
df2.to_sql('table2', conn, if_exists='replace', index=False)

1895

In [76]:
query = """ 
SELECT * 
FROM table2 
LIMIT 5
"""

query_result = pd.read_sql_query(query, conn)
query_result

,Date,Flight Number,From,To,Class,Price,Flow Card?,Bags Checked,Meal Type
0,28/09/2024,PA008,Perth,New York,Economy,1855.0,No,2,Vegetarian
1,01/10/2024,PA008,Perth,New York,Business Class,634.8,No,0,Vegetarian
2,04/03/2024,PA007,New York,Perth,Business Class,458.4,No,3,Nut Free
3,25/02/2024,PA010,Tokyo,New York,Premium Economy,1435.0,No,0,None
4,29/03/2024,PA004,Perth,London,Economy,2730.0,No,2,Vegan

# Data Preparation

In [ ]:
query1 = """
select count(*) from table1;
"""

query_result1 = pd.read_sql_query(query1, conn)
print(query_result1)

print('\n')

query2 = """
select count(*) from table2;
"""

query_result2 = pd.read_sql_query(query2, conn)
print(query_result2)

   count(*)
0      1883


   count(*)
0      1895

In [100]:
query = """ 
with full_table_cte as (
    select *
    from table1
    union all
    select *
    from table2
)

select 
*,
CASE
    WHEN CAST(substr(Date, 4, 2) AS INTEGER) BETWEEN 1 AND 3 THEN 1
    WHEN CAST(substr(Date, 4, 2) AS INTEGER) BETWEEN 4 AND 6 THEN 2
    WHEN CAST(substr(Date, 4, 2) AS INTEGER) BETWEEN 7 AND 9 THEN 3
    WHEN CAST(substr(Date, 4, 2) AS INTEGER) BETWEEN 10 AND 12 THEN 4
END AS Quarter
from full_table_cte
"""

query_result = pd.read_sql_query(query, conn)
query_result

,Date,Flight Number,From,To,Class,Price,Flow Card?,Bags Checked,Meal Type,Quarter
0,22/07/2024,PA010,Tokyo,New York,Economy,2380.0,Yes,0,Egg Free,3
1,20/04/2024,PA002,New York,London,Economy,3490.0,Yes,1,Vegan,2
2,23/01/2024,PA010,Tokyo,New York,Premium Economy,825.0,Yes,1,Vegetarian,1
3,05/06/2024,PA006,Tokyo,London,First Class,618.0,Yes,3,Vegan,2
4,30/03/2024,PA004,Perth,London,First Class,446.0,Yes,1,Nut Free,1
...,...,...,...,...,...,...,...,...,...,...
3773,06/03/2024,PA006,Tokyo,London,Premium Economy,940.0,No,2,Vegetarian,1
3774,05/05/2024,PA009,New York,Tokyo,Economy,1360.0,No,3,Nut Free,2
3775,14/06/2024,PA008,Perth,New York,First Class,245.0,No,1,Dairy Free,2
3776,16/01/2024,PA010,Tokyo,New York,Economy,2410.0,No,2,Egg Free,1
3777,16/08/2024,PA005,London,Tokyo,Premium Economy,960.0,No,0,Nut Free,3

In [ ]:
CASE
    WHEN CAST(strftime('%m', Date) AS INTEGER) BETWEEN 1 AND 3 THEN 1
    WHEN CAST(strftime('%m', Date) AS INTEGER) BETWEEN 4 AND 6 THEN 2
    WHEN CAST(strftime('%m', Date) AS INTEGER) BETWEEN 7 AND 9 THEN 3
    WHEN CAST(strftime('%m', Date) AS INTEGER) BETWEEN 10 AND 12 THEN 4
END AS Quarter

# Close Connection

In [ ]:
# Close the connection
conn.close()